// L4Task1
// Создать двумерный массив с размерами 3х5, состоящий из целых чисел.
// Вывести элементы на экран

// L4Task2
// Создать двумерный массив, состоящий из целых чисел. 
// Вывести на экран числа с четной суммой цифер.

// L4Task3
// Считать с консоли строку, состоящую из цифр и латинских букв.
// Сформировать новую строку, состоящую из букв исходной строки.

// L4Task4
// Считать с консоли строку, состоящую из цифр и латинских букв.
// Сформировать массив, состоящий из цифр этой строки.

// S5Task1
// Задайте двумерный массив. Найдите элементы, у которых оба
// индекса чётные, и замените эти элементы на их квадраты.

// S5Task2
// Задайте двумерный массив. Найдите сумму элементов,
// находящихся на главной диагонали (с индексами (0,0); (1;1) и
// т.д.)

// S5Task3
// Задайте двумерный массив из целых чисел. Сформируйте новый
// одномерный массив, состоящий из средних арифметических
// значений по строкам двумерного массива. 

// HW5Task1
// Напишите программу, которая на вход
// принимает позиции элемента в двумерном массиве, и
// возвращает значение этого элемента или же указание,
// что такого элемента нет.

// HW5Task2
// Задайте двумерный массив. Напишите
// программу, которая поменяет местами первую и
// последнюю строку массива.

// HW5Task3
// Задайте прямоугольный двумерный массив.
// Напишите программу, которая будет находить строку с
// наименьшей суммой элементов.

// HW5Task4
// Задайте двумерный массив
// из целых чисел. Напишите программу, которая удалит
// строку и столбец, на пересечении которых расположен
// наименьший элемент массива. Под удалением
// понимается создание нового двумерного массива без
// строки и столбца.
